   #!/bin/bash
   # هذا السكربت يحسب الفائدة البسيطة بناءً على المبلغ الأساسي،
   # معدل الفائدة السنوي ومدة الوقت بالسنوات.

   # لا تستخدم هذا في الإنتاج. لأغراض تجريبية فقط.

   # المؤلف: أبكار ليدر (IBM)
   # مؤلفون إضافيون:
   # <اسم مستخدم GitHub الخاص بك>

   # المدخلات:
   # p، المبلغ الأساسي
   # t، مدة الوقت بالسنوات
   # r، معدل الفائدة السنوي

   # المخرجات:
   # الفائدة البسيطة = p*t*r

   echo "أدخل المبلغ الأساسي:"
   read p
   echo "أدخل معدل الفائدة السنوية:"
   read r
   echo "أدخل مدة الوقت بالسنوات:"
   read t

   s=`expr $p \* $t \* $r / 100`
   echo "الفائدة البسيطة هي: "
   echo $s
